---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupAmongstLoadedRenamed
source: html/e3728f68-ad2d-0db8-a5d9-657083299933.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupAmongstLoadedRenamed Property

A group or groups that was loaded was renamed because its name was not unique amongst the groups in the file being loaded.
 Most likely a model subgroup had the same name as the loaded file.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupAmongstLoadedRenamed { get; }
```